Обработки/Reports/_КонтрольРасчётаКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольРасчётаКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольРасчётаКредитныхИнструментов/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Контроль расчёта кредитных инструментов",
		"0.12",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,СчетДоверительногоУправления,ЦельРасчета");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Сверить(ДокументРезультат);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры

Процедура Сверить(ДокументРезультат)
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период КАК Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК КредитныйИнструмент,
		|	СУММА(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынок) КАК ТекущаяСумма
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ОбесценениеДисконтированиеОсновнойДолг))
		|	ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Справочник.Займы
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗайму), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты)))
		|	И (&СчетНеВыбран
		|			ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|				ИЗ
		|					РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|				ГДЕ
		|					КлиентыДоверительногоУправленияСрезПоследних.Клиент = &СчетДоверительногоУправления))
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	Период";
	
	Запрос.УстановитьПараметр("ДатаНачала"					, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"				, ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетНеВыбран"				, НЕ ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления));
	
	ТаблицаСравнения = Новый ТаблицаЗначений;
	ТаблицаСравнения.Колонки.Добавить("Период"						, Новый ОписаниеТипов("Дата"));
	ТаблицаСравнения.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаСравнения.Колонки.Добавить("КредитныйИнструмент"			, Метаданные.ОпределяемыеТипы.КредитныеИнструменты.Тип);
	ТаблицаСравнения.Колонки.Добавить("НоваяСумма"					, Новый ОписаниеТипов("Число"));
	ТаблицаСравнения.Колонки.Добавить("ТекущаяСумма"				, Новый ОписаниеТипов("Число"));
	ТаблицаСравнения.Колонки.Добавить("Разница"						, Новый ОписаниеТипов("Число"));
	                                                   	
	ВыборкаСчета = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчета.Следующий() Цикл
		ВыборкаПериоды = ВыборкаСчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПериоды.Следующий() Цикл
			Попытка
				//НовыеДанныеДепозитов = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавке(ВыборкаПериоды.СчетДоверительногоУправления, КонецДня(ВыборкаПериоды.Период), Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
				НовыеДанныеДепозитов = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавкеСУчетомПериодичностиОценки(ВыборкаПериоды.СчетДоверительногоУправления, КонецДня(ВыборкаПериоды.Период), ЭтотОбъект.ЦельРасчета);
			Исключение
				//посчитаем линейно
				ТекстОшибки = ОписаниеОшибки();
				Если СтрЧислоВхождений(ТекстОшибки, "Не заполнена настройка расчета рыночной ставки по депозитным вкладам для счета ДУ") > 0  Тогда
					НовыеДанныеДепозитов = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(ВыборкаПериоды.СчетДоверительногоУправления, КонецДня(ВыборкаПериоды.Период));
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
					Продолжить;
				КонецЕсли;
			КонецПопытки;
			
			ВыборкаДепозиты = ВыборкаПериоды.Выбрать();
			Пока ВыборкаДепозиты.Следующий() Цикл
				НоваяСумма = 0;
				
				ПараметрыПоиска = Новый Структура("КредитныйИнструмент", ВыборкаДепозиты.КредитныйИнструмент);
				НайденныеСтроки = НовыеДанныеДепозитов.НайтиСтроки(ПараметрыПоиска);
				
				ЧастиСтоимости = Новый Структура("Номинал,Проценты,ПроцентыЭСП,СуммаРезерва", 0, 0, 0, 0); //если посчитан линейно - нет ПроцентыЭСП
				
				Для Каждого СтрокаДепозиты Из НайденныеСтроки Цикл
					ЗаполнитьЗначенияСвойств(ЧастиСтоимости, СтрокаДепозиты);
					НоваяСумма = НоваяСумма + Окр(ЧастиСтоимости.Номинал + ЧастиСтоимости.Проценты + ЧастиСтоимости.ПроцентыЭСП + ЧастиСтоимости.СуммаРезерва, 2);
				КонецЦикла;
				
				Если ТипЗнч(ВыборкаДепозиты.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") 
					И ВыборкаДепозиты.КредитныйИнструмент.ВидКредитногоИнструмента = перечисления.ВидыКредитныхИнструментов.Полученный Тогда
					
					НоваяСумма = - НоваяСумма;
					
				КонецЕсли;
				
				Если ВыборкаДепозиты.ТекущаяСумма <> НоваяСумма Тогда
					СтрокаСравнения = ТаблицаСравнения.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСравнения, ВыборкаДепозиты);
					СтрокаСравнения.НоваяСумма = НоваяСумма;
					СтрокаСравнения.Разница = НоваяСумма - СтрокаСравнения.ТекущаяСумма;
				КонецЕсли;
			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	Для Каждого СтрокаСравнения Из ТаблицаСравнения Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаСравнения);
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры
